---
kind: type
id: T:Autodesk.Revit.DB.SortingOrder
source: html/2ee6b86d-803f-3da1-6eaf-816ff611402a.htm
---
# Autodesk.Revit.DB.SortingOrder

Enumerated type representing the sorting order of a collection of objects.

## Syntax (C#)
```csharp
public enum SortingOrder
```